inniyah/cpik/0.7.1/include/device/p18f14k20.h
#ifndef DEVICE
#define DEVICE p18f14k20
#define p18f14k20

// ======================================
//         PROCESSOR : p18f14k20
// ======================================

// This file has been automatically generated from Microchip's "p18f14k20.inc" file.
// with the inc2h-v2 utility.             Please do not edit by hand.
// Do not use with cpik versions prior V0.7, report problems to author.
// (C) Alain Gibaud  2012    (alain.gibaud@free.fr)

#pragma firstsfr 0xf68
// ------------------------------
//        SRCON0
// ------------------------------
unsigned int SRCON0@0xf68 ;
union
{

struct 
{
  unsigned int 
  SRPR : 1 ,
  SRPS : 1 ,
  SRNQEN : 1 ,
  SRQEN : 1 ,
  SRCLK0 : 1 ,
  SRCLK1 : 1 ,
  SRCLK2 : 1 ,
  SRLEN : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  : 4,
  SRCLK : 3 ;
} ; 

} SRCON0bits@0xf68  ;

#define _SRPR 0
#define _SRPS 1
#define _SRNQEN 2
#define _SRQEN 3
#define _SRCLK0 4
#define _SRCLK1 5
#define _SRCLK2 6
#define _SRLEN 7

// The following are aliases ..  
#define _SRCLK 4:3

// ------------------------------
//        SRCON1
// ------------------------------
unsigned int SRCON1@0xf69 ;
union
{

struct 
{
  unsigned int 
  SRRC1E : 1 ,
  SRRC2E : 1 ,
  SRRCKE : 1 ,
  SRRPE : 1 ,
  SRSC1E : 1 ,
  SRSC2E : 1 ,
  SRSCKE : 1 ,
  SRSPE : 1 ;
} ; 

} SRCON1bits@0xf69  ;

#define _SRRC1E 0
#define _SRRC2E 1
#define _SRRCKE 2
#define _SRRPE 3
#define _SRSC1E 4
#define _SRSC2E 5
#define _SRSCKE 6
#define _SRSPE 7

// ------------------------------
//        CM2CON0
// ------------------------------
unsigned int CM2CON0@0xf6b ;
union
{

struct 
{
  unsigned int 
  C2CH0 : 1 ,
  C2CH1 : 1 ,
  C2R : 1 ,
  C2SP : 1 ,
  C2POL : 1 ,
  C2OE : 1 ,
  C2OUT_CM2CON0 : 1 ,
  C2ON : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  C2CH : 2 ;
} ; 

} CM2CON0bits@0xf6b  ;

#define _C2CH0 0
#define _C2CH1 1
#define _C2R 2
#define _C2SP 3
#define _C2POL 4
#define _C2OE 5
#define _C2OUT_CM2CON0 6
#define _C2ON 7

// The following are aliases ..  
#define _C2CH 0:2

// ------------------------------
//        CM2CON1
// ------------------------------
unsigned int CM2CON1@0xf6c ;
union
{

struct 
{
  unsigned int 
  C2SYNC : 1 ,
  C1SYNC : 1 ,
  C2HYS : 1 ,
  C1HYS : 1 ,
  C2RSEL : 1 ,
  C1RSEL : 1 ,
  MC2OUT : 1 ,
  MC1OUT : 1 ;
} ; 

} CM2CON1bits@0xf6c  ;

#define _C2SYNC 0
#define _C1SYNC 1
#define _C2HYS 2
#define _C1HYS 3
#define _C2RSEL 4
#define _C1RSEL 5
#define _MC2OUT 6
#define _MC1OUT 7

// ------------------------------
//        CM1CON0
// ------------------------------
unsigned int CM1CON0@0xf6d ;
union
{

struct 
{
  unsigned int 
  C1CH0 : 1 ,
  C1CH1 : 1 ,
  C1R : 1 ,
  C1SP : 1 ,
  C1POL : 1 ,
  C1OE : 1 ,
  C1OUT_CM1CON0 : 1 ,
  C1ON : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  C1CH : 2 ;
} ; 

} CM1CON0bits@0xf6d  ;

#define _C1CH0 0
#define _C1CH1 1
#define _C1R 2
#define _C1SP 3
#define _C1POL 4
#define _C1OE 5
#define _C1OUT_CM1CON0 6
#define _C1ON 7

// The following are aliases ..  
#define _C1CH 0:2

// ------------------------------
//        SSPMASK
// ------------------------------
unsigned int SSPMASK@0xf6f ;
union
{

struct 
{
  unsigned int 
  MSK0 : 1 ,
  MSK1 : 1 ,
  MSK2 : 1 ,
  MSK3 : 1 ,
  MSK4 : 1 ,
  MSK5 : 1 ,
  MSK6 : 1 ,
  MSK7 : 1 ;
} ; 

} SSPMASKbits@0xf6f  ;

#define _MSK0 0
#define _MSK1 1
#define _MSK2 2
#define _MSK3 3
#define _MSK4 4
#define _MSK5 5
#define _MSK6 6
#define _MSK7 7

// ------------------------------
//        APFCON
// ------------------------------
unsigned int APFCON@0xf75 ;
union
{

struct 
{
  unsigned int 
  C1SEL : 1 ,
  T0CKISEL : 1 ,
  INT2SEL : 1 ,
  SRQSEL : 1 ;
} ; 

} APFCONbits@0xf75  ;

#define _C1SEL 0
#define _T0CKISEL 1
#define _INT2SEL 2
#define _SRQSEL 3

// ------------------------------
//        SLRCON
// ------------------------------
unsigned int SLRCON@0xf76 ;
union
{

struct 
{
  unsigned int 
  SLRA : 1 ,
  SLRB : 1 ,
  SLRC : 1 ;
} ; 

} SLRCONbits@0xf76  ;

#define _SLRA 0
#define _SLRB 1
#define _SLRC 2

// ------------------------------
//        WPUA
// ------------------------------
unsigned int WPUA@0xf77 ;
union
{

struct 
{
  unsigned int 
  WPUA0 : 1 ,
  WPUA1 : 1 ,
  WPUA2 : 1 ,
  WPUA3 : 1 ,
  WPUA4 : 1 ,
  WPUA5 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  WPUA : 6 ;
} ; 

} WPUAbits@0xf77  ;

#define _WPUA0 0
#define _WPUA1 1
#define _WPUA2 2
#define _WPUA3 3
#define _WPUA4 4
#define _WPUA5 5

// The following are aliases ..  
#define _WPUA 0:6

// ------------------------------
//        WPUB
// ------------------------------
unsigned int WPUB@0xf78 ;
union
{

struct 
{
  unsigned int 
  : 4,
  WPUB4 : 1 ,
  WPUB5 : 1 ,
  WPUB6 : 1 ,
  WPUB7 : 1 ;
} ; 

} WPUBbits@0xf78  ;

#define _WPUB4 4
#define _WPUB5 5
#define _WPUB6 6
#define _WPUB7 7

// ------------------------------
//        IOCA
// ------------------------------
unsigned int IOCA@0xf79 ;
union
{

struct 
{
  unsigned int 
  IOCA0 : 1 ,
  IOCA1 : 1 ,
  IOCA2 : 1 ,
  IOCA3 : 1 ,
  IOCA4 : 1 ,
  IOCA5 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  IOCA : 6 ;
} ; 

} IOCAbits@0xf79  ;

#define _IOCA0 0
#define _IOCA1 1
#define _IOCA2 2
#define _IOCA3 3
#define _IOCA4 4
#define _IOCA5 5

// The following are aliases ..  
#define _IOCA 0:6

// ------------------------------
//        IOCB
// ------------------------------
unsigned int IOCB@0xf7a ;
union
{

struct 
{
  unsigned int 
  : 4,
  IOCB4 : 1 ,
  IOCB5 : 1 ,
  IOCB6 : 1 ,
  IOCB7 : 1 ;
} ; 

} IOCBbits@0xf7a  ;

#define _IOCB4 4
#define _IOCB5 5
#define _IOCB6 6
#define _IOCB7 7

// ------------------------------
//        ANSEL
// ------------------------------
unsigned int ANSEL@0xf7e ;
union
{

struct 
{
  unsigned int 
  ANS0 : 1 ,
  ANS1 : 1 ,
  ANS2 : 1 ,
  ANS3 : 1 ,
  ANS4 : 1 ,
  ANS5 : 1 ,
  ANS6 : 1 ,
  ANS7 : 1 ;
} ; 

} ANSELbits@0xf7e  ;

#define _ANS0 0
#define _ANS1 1
#define _ANS2 2
#define _ANS3 3
#define _ANS4 4
#define _ANS5 5
#define _ANS6 6
#define _ANS7 7

// ------------------------------
//        ANSELH
// ------------------------------
unsigned int ANSELH@0xf7f ;
union
{

struct 
{
  unsigned int 
  ANS8 : 1 ,
  ANS9 : 1 ,
  ANS10 : 1 ,
  ANS11 : 1 ;
} ; 

