inniyah/cpik/0.7.1/include/device/p18f14k20.h
} ANSELHbits@0xf7f  ;

#define _ANS8 0
#define _ANS9 1
#define _ANS10 2
#define _ANS11 3

// ------------------------------
//        PORTA
// ------------------------------
unsigned int PORTA@0xf80 ;
union
{

struct 
{
  unsigned int 
  RA0 : 1 ,
  RA1 : 1 ,
  RA2 : 1 ,
  RA3 : 1 ,
  RA4 : 1 ,
  RA5 : 1 ;
} ; 

struct 
{
  unsigned int 
  AN0 : 1 ,
  AN1 : 1 ,
  AN2 : 1 ,
  : 1,
  AN3 : 1 ,
  T13CKI : 1 ;
} ; 

struct 
{
  unsigned int 
  C1INP : 1 ,
  C12IN0M : 1 ,
  C1OUT_PORTA : 1 ,
  : 1,
  OSC2 : 1 ,
  OSC1 : 1 ;
} ; 

struct 
{
  unsigned int 
  INT0 : 1 ,
  VREFP : 1 ,
  SRQ : 1 ,
  : 1,
  CLKO : 1 ,
  CLKI : 1 ;
} ; 

struct 
{
  unsigned int 
  : 1,
  INT1 : 1 ,
  INT2 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  RA : 6 ;
} ; 

struct 
{
  unsigned int 
  AN : 3 ;
} ; 

} PORTAbits@0xf80  ;

#define _RA0 0
#define _RA1 1
#define _RA2 2
#define _RA3 3
#define _RA4 4
#define _RA5 5

#define _AN0 0
#define _AN1 1
#define _AN2 2
#define _AN3 4
#define _T13CKI 5

#define _C1INP 0
#define _C12IN0M 1
#define _C1OUT_PORTA 2
#define _OSC2 4
#define _OSC1 5

#define _INT0 0
#define _VREFP 1
#define _SRQ 2
#define _CLKO 4
#define _CLKI 5

#define _INT1 1
#define _INT2 2

// The following are aliases ..  
#define _RA 0:6

#define _AN 0:3

// ------------------------------
//        PORTB
// ------------------------------
unsigned int PORTB@0xf81 ;
union
{

struct 
{
  unsigned int 
  : 4,
  RB4 : 1 ,
  RB5 : 1 ,
  RB6 : 1 ,
  RB7 : 1 ;
} ; 

struct 
{
  unsigned int 
  : 4,
  SDI : 1 ,
  RX : 1 ,
  SCL : 1 ,
  TX : 1 ;
} ; 

struct 
{
  unsigned int 
  : 4,
  SDA : 1 ,
  AN11 : 1 ,
  SCK : 1 ,
  CK : 1 ;
} ; 

struct 
{
  unsigned int 
  : 4,
  AN10 : 1 ;
} ; 

} PORTBbits@0xf81  ;

#define _RB4 4
#define _RB5 5
#define _RB6 6
#define _RB7 7

#define _SDI 4
#define _RX 5
#define _SCL 6
#define _TX 7

#define _SDA 4
#define _AN11 5
#define _SCK 6
#define _CK 7

#define _AN10 4

// ------------------------------
//        PORTC
// ------------------------------
unsigned int PORTC@0xf82 ;
union
{

struct 
{
  unsigned int 
  RC0 : 1 ,
  RC1 : 1 ,
  RC2 : 1 ,
  RC3 : 1 ,
  RC4 : 1 ,
  RC5 : 1 ,
  RC6 : 1 ,
  RC7 : 1 ;
} ; 

struct 
{
  unsigned int 
  AN4 : 1 ,
  AN5 : 1 ,
  AN6 : 1 ,
  AN7 : 1 ,
  C2OUT_PORTC : 1 ,
  CCP1 : 1 ,
  AN8 : 1 ,
  AN9 : 1 ;
} ; 

struct 
{
  unsigned int 
  C12INP : 1 ,
  C12IN1M : 1 ,
  C12IN2M : 1 ,
  C12IN3M : 1 ,
  NOT_SRQ : 1 ,
  P1A : 1 ,
  SS : 1 ,
  SDO : 1 ;
} ; 

struct 
{
  unsigned int 
  : 1,
  VREFM : 1 ,
  P1D : 1 ,
  PGM : 1 ,
  P1B : 1 ,
  : 1,
  NOT_SS : 1 ;
} ; 

struct 
{
  unsigned int 
  : 3,
  P1C : 1 ;
} ; 

} PORTCbits@0xf82  ;

#define _RC0 0
#define _RC1 1
#define _RC2 2
#define _RC3 3
#define _RC4 4
#define _RC5 5
#define _RC6 6
#define _RC7 7

#define _AN4 0
#define _AN5 1
#define _AN6 2
#define _AN7 3
#define _C2OUT_PORTC 4
#define _CCP1 5
#define _AN8 6
#define _AN9 7

#define _C12INP 0
#define _C12IN1M 1
#define _C12IN2M 2
#define _C12IN3M 3
#define _NOT_SRQ 4
#define _P1A 5
#define _SS 6
#define _SDO 7

#define _VREFM 1
#define _P1D 2
#define _PGM 3
#define _P1B 4
#define _NOT_SS 6

#define _P1C 3

// ------------------------------
//        LATA
// ------------------------------
unsigned int LATA@0xf89 ;
union
{

struct 
{
  unsigned int 
  LATA0 : 1 ,
  LATA1 : 1 ,
  LATA2 : 1 ,
  : 1,
  LATA4 : 1 ,
  LATA5 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  LATA : 3 ;
} ; 

} LATAbits@0xf89  ;

#define _LATA0 0
#define _LATA1 1
#define _LATA2 2
#define _LATA4 4
#define _LATA5 5

// The following are aliases ..  
#define _LATA 0:3

// ------------------------------
//        LATB
// ------------------------------
unsigned int LATB@0xf8a ;
union
{

struct 
{
  unsigned int 
  : 4,
  LATB4 : 1 ,
  LATB5 : 1 ,
  LATB6 : 1 ,
  LATB7 : 1 ;
} ; 

} LATBbits@0xf8a  ;

#define _LATB4 4
#define _LATB5 5
#define _LATB6 6
#define _LATB7 7

// ------------------------------
//        LATC
// ------------------------------
unsigned int LATC@0xf8b ;
union
{

struct 
{
  unsigned int 
  LATC0 : 1 ,
  LATC1 : 1 ,
  LATC2 : 1 ,
  LATC3 : 1 ,
  LATC4 : 1 ,
  LATC5 : 1 ,
  LATC6 : 1 ,
  LATC7 : 1 ;
} ; 

} LATCbits@0xf8b  ;

#define _LATC0 0
#define _LATC1 1
#define _LATC2 2
#define _LATC3 3
#define _LATC4 4
#define _LATC5 5
#define _LATC6 6
#define _LATC7 7

// ------------------------------
//        DDRA
// ------------------------------
unsigned int DDRA@0xf92 ;
union
{

struct 
{
  unsigned int 
  RA0 : 1 ,
  RA1 : 1 ,
  RA2 : 1 ,
  : 1,
  RA4 : 1 ,
  RA5 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  RA : 3 ;
} ; 

} DDRAbits@0xf92  ;

#define _RA0 0
#define _RA1 1
#define _RA2 2
#define _RA4 4
#define _RA5 5

// The following are aliases ..  
#define _RA 0:3

// ------------------------------
//        TRISA
// ------------------------------
unsigned int TRISA@0xf92 ;
union
{

struct 
{
  unsigned int 
  TRISA0 : 1 ,
  TRISA1 : 1 ,
  TRISA2 : 1 ,
  : 1,
  TRISA4 : 1 ,
  TRISA5 : 1 ;
} ; 

// The following are aliases ..  
struct 
{
  unsigned int 
  TRISA : 3 ;
} ; 

} TRISAbits@0xf92  ;

#define _TRISA0 0
#define _TRISA1 1
#define _TRISA2 2
#define _TRISA4 4
#define _TRISA5 5

// The following are aliases ..  
#define _TRISA 0:3

// ------------------------------
//        DDRB
// ------------------------------
unsigned int DDRB@0xf93 ;
union
{

struct 
{
  unsigned int 
  : 4,
  RB4 : 1 ,
  RB5 : 1 ,
  RB6 : 1 ,
  RB7 : 1 ;
} ; 

} DDRBbits@0xf93  ;

#define _RB4 4
#define _RB5 5
#define _RB6 6
#define _RB7 7

// ------------------------------
//        TRISB
// ------------------------------
unsigned int TRISB@0xf93 ;
union
{

struct 
{
  unsigned int 
  : 4,
  TRISB4 : 1 ,
  TRISB5 : 1 ,
  TRISB6 : 1 ,
  TRISB7 : 1 ;
} ; 

} TRISBbits@0xf93  ;

#define _TRISB4 4
#define _TRISB5 5
#define _TRISB6 6
#define _TRISB7 7

// ------------------------------
//        DDRC
// ------------------------------
unsigned int DDRC@0xf94 ;
union
{

struct 
{
  unsigned int 
  RC0 : 1 ,
  RC1 : 1 ,
  RC2 : 1 ,
  RC3 : 1 ,
  RC4 : 1 ,
  RC5 : 1 ,
  RC6 : 1 ,
  RC7 : 1 ;
} ; 

} DDRCbits@0xf94  ;

